app/controllers/authentication_controller.rb

  def signin
    @user = User.find_by_username(signin_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "dae"], ["LIMIT", 1]]