app/controllers/pets_controller.rb

  def create
    @pet = current_user.pet.create(pet_params)
    @pet.user = @current_user
    @pet.category = Category.find(7)
---
INSERT INTO "pets" ("name", "image", "breed", "age", "description", "user_id", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @pet = current_user.pets.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def destroy
    @pet.destroy
---
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 5]]